In this notebook I'll clean my csv-data and make it ready for doing a networkchart

In [161]:
import requests
import pandas as pd

In [162]:
# cheking my data

list_df = pd.read_csv("companyname.csv")
# list_df.head()

In [163]:
list_df.dtypes

personname     object
role           object
companyname    object
marketvalue    object
dtype: object

In [164]:
list_df["companyname"] = (
    list_df["companyname"]
    .str.replace("Oy", "")
    .str.replace("Oyj", "")
    .str.replace("Bank", "")
    .str.replace("Group", "")
    .str.replace("Abp", "")
    .str.replace("AB", "")
    .str.replace("Ab", "")
    .str.replace("International", "")
    .str.replace("VMC", "")
)
#list_df

In [165]:
list_df["companyname"] = (
    list_df["companyname"]
    .str.replace("j", "")
)
#list_df

In [166]:
list_df["companyname"] = (
    list_df["companyname"]
    .str.replace("EVRY", "evry")
)
# list_df

In [167]:
# I want to know, on how many company board seats each person has.
# Couldn't figure this out my self > asked ChatGPT

person_companies = list_df.groupby('personname')['companyname'].apply(lambda x: ', '.join(x)).reset_index()
person_companies.rename(columns={'companyname': 'companyboards'}, inplace=True)
result_df = pd.merge(list_df, person_companies, on='personname', how='left')
result_df = result_df[['personname', 'role', 'companyname', 'marketvalue', 'companyboards']].drop_duplicates()

In [168]:
#result_df.head(20)

In [169]:
# drop one column and then some cleaning still. But I'm messing things up all the time!!

# result_df = result_df.drop(columns=['companyname'])
result_df.head()

,personname,role,companyname,marketvalue,companyboards
0,Matti Saastamoinen,Hallituksen jäsen,Gofore,"357 834 176,15",Gofore
1,Thomas Slettemoen,Hallituksen jäsen,Tietoevry,"2 193 245 278,92",Tietoevry
2,Anders Palklint,Hallituksen jäsen,Tietoevry,"2 193 245 278,92",Tietoevry
3,Kasper Skovgaard Pedersen,Hallituksen jäsen,Nordea,"38 175 846 731,55",Nordea
4,Arne Larsen,Hallituksen jäsen,Anora,"335 065 975,04",Anora

In [170]:
# result_df['companyboards'] = result_df['companyboards'].str.replace('SS', 'SSAB')

In [171]:
# result_df['companyboards'] = result_df['companyboards'].str.replace('KH', 'KH Group')
# result_df.head(50)

In [172]:
#result_df['marketvalue'] = result_df['marketvalue'].str.replace(' ', '')
#result_df.head()

In [173]:
# result_df["marketvalue"] = (
#    list_df["marketvalue"]
#    .str.replace("...", ".")
# )
result_df.head()

,personname,role,companyname,marketvalue,companyboards
0,Matti Saastamoinen,Hallituksen jäsen,Gofore,"357 834 176,15",Gofore
1,Thomas Slettemoen,Hallituksen jäsen,Tietoevry,"2 193 245 278,92",Tietoevry
2,Anders Palklint,Hallituksen jäsen,Tietoevry,"2 193 245 278,92",Tietoevry
3,Kasper Skovgaard Pedersen,Hallituksen jäsen,Nordea,"38 175 846 731,55",Nordea
4,Arne Larsen,Hallituksen jäsen,Anora,"335 065 975,04",Anora

In [178]:
# result_df['marketvalue'] = result_df['marketvalue'].str.replace(r'\s+', '', regex=True)
# result_df['marketvalue'] = result_df['marketvalue'].str.replace(',', '.')
# result_df['marketvalue'] = result_df['marketvalue'].astype(float)
# result_df.dtypes

In [175]:
result_df.head()

,personname,role,companyname,marketvalue,companyboards
0,Matti Saastamoinen,Hallituksen jäsen,Gofore,3.578342e+08,Gofore
1,Thomas Slettemoen,Hallituksen jäsen,Tietoevry,2.193245e+09,Tietoevry
2,Anders Palklint,Hallituksen jäsen,Tietoevry,2.193245e+09,Tietoevry
3,Kasper Skovgaard Pedersen,Hallituksen jäsen,Nordea,3.817585e+10,Nordea
4,Arne Larsen,Hallituksen jäsen,Anora,3.350660e+08,Anora

In [179]:
import numpy as np

In [180]:
result_df['marketvalue'] = np.ceil(result_df['marketvalue']).astype(int)

In [181]:
result_df.head()

,personname,role,companyname,marketvalue,companyboards
0,Matti Saastamoinen,Hallituksen jäsen,Gofore,357834177,Gofore
1,Thomas Slettemoen,Hallituksen jäsen,Tietoevry,2193245279,Tietoevry
2,Anders Palklint,Hallituksen jäsen,Tietoevry,2193245279,Tietoevry
3,Kasper Skovgaard Pedersen,Hallituksen jäsen,Nordea,38175846732,Nordea
4,Arne Larsen,Hallituksen jäsen,Anora,335065976,Anora

In [185]:
result_df = result_df.drop(columns=['companyname', 'role'])

In [186]:
result_df.head()

                  personname  marketvalue companyboards
0         Matti Saastamoinen    357834177       Gofore
1          Thomas Slettemoen   2193245279    Tietoevry
2            Anders Palklint   2193245279    Tietoevry
3  Kasper Skovgaard Pedersen  38175846732      Nordea
4                Arne Larsen    335065976       Anora

In [187]:
# csv_file_path = 'result.csv'
# result_df.to_csv(csv_file_path, index=False)
# from IPython.display import FileLink
# FileLink(csv_file_path)

/Users/arminiemela/Desktop/networkproject/result.csv